Revit 2027 API
WireTypeSet.Erase Method
Removes a specified wire type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	WireType item
)
Public Overridable Function Erase (
	item As WireType
) As Integer
public:
virtual int Erase(
	WireType^ item
)
abstract Erase :
        item : WireType -> int
override Erase :
        item : WireType -> int
Parameters
item WireType
The wire type to be erased.
Return Value
Int32
The number of wire types that were erased from the set.
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace